In [1]:
import pandas as pd
pakistan_weather=pd.DataFrame({
    'city':['Karachi','Lahore','Islamabad'],
    'tempearture':[35,30,20],
    'event':['sunny','sunny','cloudy']
})
pakistan_weather

        city  tempearture   event
0    Karachi           35   sunny
1     Lahore           30   sunny
2  Islamabad           20  cloudy

In [2]:
india_weather=pd.DataFrame({
    'city':['mumbai','banglore','delhi'],
    'tempearture':[40,35,44],
    'event':['sunny','cloudy','sunny']
})
india_weather

       city  tempearture   event
0    mumbai           40   sunny
1  banglore           35  cloudy
2     delhi           44   sunny

In [5]:
df=pd.concat([pakistan_weather,india_weather],ignore_index=True)
df

        city  tempearture   event
0    Karachi           35   sunny
1     Lahore           30   sunny
2  Islamabad           20  cloudy
3     mumbai           40   sunny
4   banglore           35  cloudy
5      delhi           44   sunny

In [6]:
df=pd.concat([pakistan_weather,india_weather],keys=['Pakistan','India'])
df

                 city  tempearture   event
Pakistan 0    Karachi           35   sunny
         1     Lahore           30   sunny
         2  Islamabad           20  cloudy
India    0     mumbai           40   sunny
         1   banglore           35  cloudy
         2      delhi           44   sunny

In [11]:
temperature_df=pd.DataFrame({
    'city':['Karachi','Lahore','Islamabad'],
    'tempearture':[35,30,20]
})
temperature_df

        city  tempearture
0    Karachi           35
1     Lahore           30
2  Islamabad           20

In [14]:
windspead_df=pd.DataFrame({
    'city':['Islamabad','Karachi','Lahore'],
    'windspead':[10,20,30]
},index=[2,0,1])
windspead_df

        city  windspead
2  Islamabad         10
0    Karachi         20
1     Lahore         30

In [15]:
df=pd.concat([temperature_df,windspead_df],axis=1)
df

        city  tempearture       city  windspead
0    Karachi           35    Karachi         20
1     Lahore           30     Lahore         30
2  Islamabad           20  Islamabad         10